import numpy as np


# =============================================================================
# 1. 환경 및 위치 데이터 (Environmental Data)
# =============================================================================
# 수치해석 환경 설정(파고[Hs], 피크주기[Tp], 수심[h])
LOCATIONS = {
    "Buan": (1.07, 5.46, 50),
    "Chilbaldo": (0.87, 4.48, 33),
    "Yeongilmanhang": ( 0.92, 6.66, 13)
}

# 현재 사용할 위치 선택
CURRENT_LOC = "Buan"
Hs = LOCATIONS[CURRENT_LOC][0]
Tp = LOCATIONS[CURRENT_LOC][1]
h = LOCATIONS[CURRENT_LOC][2]

# =============================================================================
# 2. 물리적 제약 조건 (Physical Constraints)
# =============================================================================
BOUNDS = {'x1': [3.0, 15], 'y1': [0, 30.0],
          'x2': [3.0, 15], 'y2': [0, 30.0],
          'x3': [3.0, 15], 'y3': [0, 0],
          'r' : [0.5, 2.5], 'd': [0.5, 5.0]}

STEP_SIZE = np.array([0.1] * 8)     # 그리드 간격 (m)

# =============================================================================
# 3. 알고리즘 공통 설정 (Optimization Settings)
# =============================================================================
PARTICLE_SIZE = 100
MAX_ITER = 500

# =============================================================================
# 4. 알고리즘별 전용 하이퍼파라미터 (Hyperparameters)
# =============================================================================
# DE 알고리즘 하이퍼파라미터
DE_PARAMS = {
    'F': 0.5,
    'CR': 0.7
}

# DEPSO 알고리즘 하이퍼파라미터
DEPSO_PARAMS = {
    'F': 0.7,
    'CR': 0.8,
    'w' : 0.5,
    'c1': 1.5,
    'c2': 1.5
}

# GA 알고리즘 하이퍼파라미터
GA_PARAMS = {
    'CR': 0.8,
    'F': 0.01
}

# =============================================================================
# 5. 경로 및 로깅 (Paths & Logging)
# =============================================================================
RESULTS_PATH = 'geo_layout_cal_results.res'
ITER_PATH = 'geo_layout_iter_results.res'